window.WEAPONS_DATA = [
  {
    id: "weapon_craft",
    dataset: "weapons",
    title: "Крафт оружия",
    subtitle: "Оружие → материалы (без кнопок)",
    groups: [
      { groupTitle: "Оружие", items: [
        { name: "Заколка", recipe: [
          { name: "Металлические детали", qty: 2 },
          { name: "Пластиковые детали", qty: 5 },
        ]},
        { name: "Бурлетта", recipe: [
          { name: "Механические компоненты", qty: 3 },
          { name: "Простые детали оружия", qty: 3 },
        ]},
        { name: "Наковальная", recipe: [
          { name: "Механические компоненты", qty: 5 },
          { name: "Простые детали оружия", qty: 6 },
        ]},
        { name: "Охотник", recipe: [
          { name: "Продвинутые механические компоненты", qty: 2 },
          { name: "Детали для оружия среднего калибра", qty: 3 },
          { name: "Магнит", qty: 5 },
        ]},
        { name: "Сшиватель", recipe: [
          { name: "Металлические детали", qty: 8 },
          { name: "Резиновые детали", qty: 4 },
        ]},
        { name: "Рысь", recipe: [
          { name: "Магнитный ускоритель", qty: 1 },
          { name: "Детали для легкого оружия", qty: 3 },
          { name: "Модули Исхода", qty: 2 },
        ]},
        { name: "Трещотка", recipe: [
          { name: "Металлические детали", qty: 16 },
          { name: "Резиновые детали", qty: 12 },
        ]},
        { name: "Чайник", recipe: [
          { name: "Металлические детали", qty: 6 },
          { name: "Резиновые детали", qty: 8 },
        ]},
        { name: "Арпеджио", recipe: [
          { name: "Механические компоненты", qty: 6 },
          { name: "Простые детали оружия", qty: 6 },
        ]},
        { name: "Буря", recipe: [
          { name: "Магнитный ускоритель", qty: 1 },
          { name: "Детали для оружия среднего калибра", qty: 3 },
          { name: "Модули Исхода", qty: 2 },
        ]},
        { name: "Беттина", recipe: [
          { name: "Продвинутые механические компоненты", qty: 3 },
          { name: "Детали для тяжелого оружия", qty: 3 },
          { name: "Канистра", qty: 3 },
        ]},
        { name: "Афелий", recipe: [
          { name: "Магнитный ускоритель", qty: 3 },
          { name: "Сложные детали для оружия", qty: 3 },
          { name: "Реактор «Матриарха»", qty: 1 },
        ]},
        { name: "Ферро", recipe: [
          { name: "Металлические детали", qty: 5 },
          { name: "Резиновые детали", qty: 2 },
        ]},
        { name: "Бунтарь", recipe: [
          { name: "Продвинутые механические компоненты", qty: 2 },
          { name: "Детали для оружия среднего калибра", qty: 3 },
          { name: "Масло", qty: 5 },
        ]},
        { name: "Ястреб", recipe: [
          { name: "Продвинутые механические компоненты", qty: 2 },
          { name: "Детали для оружия среднего калибра", qty: 3 },
          { name: "Провода", qty: 7 },
        ]},
        { name: "Юпитер", recipe: [
          { name: "Магнитный ускоритель", qty: 3 },
          { name: "Сложные детали для оружия", qty: 3 },
          { name: "Реактор «Королевы»", qty: 1 },
        ]},
        { name: "Торренте", recipe: [
          { name: "Продвинутые механические компоненты", qty: 2 },
          { name: "Детали для оружия среднего калибра", qty: 3 },
          { name: "Стальная пружина", qty: 6 },
        ]},
        { name: "Уравнитель", recipe: [
          { name: "Магнитный ускоритель", qty: 3 },
          { name: "Сложные детали для оружия", qty: 3 },
          { name: "Реактор «Королевы»", qty: 1 },
        ]},
        { name: "Эль-Торо", recipe: [
          { name: "Механические компоненты", qty: 5 },
          { name: "Простые детали оружия", qty: 6 },
        ]},
        { name: "Вулкан", recipe: [
          { name: "Магнитный ускоритель", qty: 1 },
          { name: "Детали для тяжелого оружия", qty: 3 },
          { name: "Модули Исхода", qty: 1 },
        ]},
        { name: "Взломщик корпусов", recipe: [
          { name: "Магнитный ускоритель", qty: 1 },
          { name: "Детали для тяжелого оружия", qty: 3 },
          { name: "Модули Исхода", qty: 1 },
        ]},
      ]}
    ]
  }
];
